// JavaScript Document<script>
$(function(){  
   
   $('#line_p_con').jqChart({
                title: { text: '按区域统计线状图' },//图表标题
                border: { strokeStyle: '#000' },//边线颜色
               
              
                axes: [/*此处是对轴线的一些优化*/
                        {
                            location: 'left',
                            minimum: 0,
                            maximum: 100,
                            interval: 10
                        }
                      ],
				 labelX : [("X1","X2","X3","X4","X5","X6","X7","X8","X9","10")],
                series: [
                            {
                                title:"高新区数量统计",
                                type: 'line',
								font:'12px',
								 fillStyle: 'red', 
                                data: [
                                      ['1月',  15],
                                      ['2月',  23],
                                      ['3月',  60],
                                      ['4月',  50],
                                      ['5月',  30],
                                      ['6月',  40],
							
									  ['7月',  80],
									   ['8月',  40],
									  ['9月',  60],
									  ['10月', 91],
									  ['11月',  30],
									  ['12月',  50],
									  ]
                            },
                             {
                                title:"成华区数据统计",
                                type: 'line',
                                data: [
                                     ['1月',  30],
                                      ['2月',  20],
                                      ['3月',  10],
                                      ['4月',  55],
                                      ['5月',  60],
                                      ['6月',  40],
									  ['7月',  70],
									   ['8月',  40],
									  ['9月',  62],
									  ['10月', 50],
									  ['11月',  90],
									  ['12月',  50],

                                      
                                ]
                            },
							{
                                title:"金牛区数据统计",
                                type: 'line',
                                data: [
                                     ['1月',  60],
                                      ['2月',  20],
                                      ['3月',  90],
                                      ['4月',  50],
                                      ['5月',  60],
                                      ['6月',  50],
									  ['7月',  76],
									   ['8月',  40],
									  ['9月',  60],
									  ['10月', 60],
									  ['11月',  28],
									  ['12月',  50],

                                      
                                ]
                            },
							{
                                title:"青羊区数据统计",
                                type: 'line',
                                data: [
                                     ['1月',  50],
                                      ['2月',  20],
                                      ['3月',  80],
                                      ['4月',  50],
                                      ['5月',  60],
                                      ['6月',  50],
									  ['7月',  10],
									   ['8月',  40],
									  ['9月',  66],
									  ['10月', 40],
									  ['11月',  20],
									  ['12月',  50],

                                      
                                ]
                            }
							,
                             {
                                title:"锦江区数据统计",
                                type: 'line',
                                data: [
                                                                         ['1月',  30],
                                      ['2月',  30],
                                      ['3月',  90],
                                      ['4月',  50],
                                      ['5月',  60],
                                      ['6月',  40],
									  ['7月',  70],
									   ['8月',  48],
									  ['9月',  60],
									  ['10月', 80],
									  ['11月',  20],
									  ['12月',  10],

                                      
                                ]
                            }
                        ]
            });
}); 

